MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2585/mcu.h
extern volatile B4D3bits_t B4D3bits __at(0xE69);
// bitfield macros
#define _B4D3_B4D30_POSN                                    0x0
#define _B4D3_B4D30_POSITION                                0x0
#define _B4D3_B4D30_SIZE                                    0x1
#define _B4D3_B4D30_LENGTH                                  0x1
#define _B4D3_B4D30_MASK                                    0x1
#define _B4D3_B4D31_POSN                                    0x1
#define _B4D3_B4D31_POSITION                                0x1
#define _B4D3_B4D31_SIZE                                    0x1
#define _B4D3_B4D31_LENGTH                                  0x1
#define _B4D3_B4D31_MASK                                    0x2
#define _B4D3_B4D32_POSN                                    0x2
#define _B4D3_B4D32_POSITION                                0x2
#define _B4D3_B4D32_SIZE                                    0x1
#define _B4D3_B4D32_LENGTH                                  0x1
#define _B4D3_B4D32_MASK                                    0x4
#define _B4D3_B4D33_POSN                                    0x3
#define _B4D3_B4D33_POSITION                                0x3
#define _B4D3_B4D33_SIZE                                    0x1
#define _B4D3_B4D33_LENGTH                                  0x1
#define _B4D3_B4D33_MASK                                    0x8
#define _B4D3_B4D34_POSN                                    0x4
#define _B4D3_B4D34_POSITION                                0x4
#define _B4D3_B4D34_SIZE                                    0x1
#define _B4D3_B4D34_LENGTH                                  0x1
#define _B4D3_B4D34_MASK                                    0x10
#define _B4D3_B4D35_POSN                                    0x5
#define _B4D3_B4D35_POSITION                                0x5
#define _B4D3_B4D35_SIZE                                    0x1
#define _B4D3_B4D35_LENGTH                                  0x1
#define _B4D3_B4D35_MASK                                    0x20
#define _B4D3_B4D36_POSN                                    0x6
#define _B4D3_B4D36_POSITION                                0x6
#define _B4D3_B4D36_SIZE                                    0x1
#define _B4D3_B4D36_LENGTH                                  0x1
#define _B4D3_B4D36_MASK                                    0x40
#define _B4D3_B4D37_POSN                                    0x7
#define _B4D3_B4D37_POSITION                                0x7
#define _B4D3_B4D37_SIZE                                    0x1
#define _B4D3_B4D37_LENGTH                                  0x1
#define _B4D3_B4D37_MASK                                    0x80

// Register: B4D4
#define B4D4 B4D4
extern volatile unsigned char           B4D4                __at(0xE6A);
#ifndef _LIB_BUILD
asm("B4D4 equ 0E6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D40                  :1;
        unsigned B4D41                  :1;
        unsigned B4D42                  :1;
        unsigned B4D43                  :1;
        unsigned B4D44                  :1;
        unsigned B4D45                  :1;
        unsigned B4D46                  :1;
        unsigned B4D47                  :1;
    };
} B4D4bits_t;
extern volatile B4D4bits_t B4D4bits __at(0xE6A);
// bitfield macros
#define _B4D4_B4D40_POSN                                    0x0
#define _B4D4_B4D40_POSITION                                0x0
#define _B4D4_B4D40_SIZE                                    0x1
#define _B4D4_B4D40_LENGTH                                  0x1
#define _B4D4_B4D40_MASK                                    0x1
#define _B4D4_B4D41_POSN                                    0x1
#define _B4D4_B4D41_POSITION                                0x1
#define _B4D4_B4D41_SIZE                                    0x1
#define _B4D4_B4D41_LENGTH                                  0x1
#define _B4D4_B4D41_MASK                                    0x2
#define _B4D4_B4D42_POSN                                    0x2
#define _B4D4_B4D42_POSITION                                0x2
#define _B4D4_B4D42_SIZE                                    0x1
#define _B4D4_B4D42_LENGTH                                  0x1
#define _B4D4_B4D42_MASK                                    0x4
#define _B4D4_B4D43_POSN                                    0x3
#define _B4D4_B4D43_POSITION                                0x3
#define _B4D4_B4D43_SIZE                                    0x1
#define _B4D4_B4D43_LENGTH                                  0x1
#define _B4D4_B4D43_MASK                                    0x8
#define _B4D4_B4D44_POSN                                    0x4
#define _B4D4_B4D44_POSITION                                0x4
#define _B4D4_B4D44_SIZE                                    0x1
#define _B4D4_B4D44_LENGTH                                  0x1
#define _B4D4_B4D44_MASK                                    0x10
#define _B4D4_B4D45_POSN                                    0x5
#define _B4D4_B4D45_POSITION                                0x5
#define _B4D4_B4D45_SIZE                                    0x1
#define _B4D4_B4D45_LENGTH                                  0x1
#define _B4D4_B4D45_MASK                                    0x20
#define _B4D4_B4D46_POSN                                    0x6
#define _B4D4_B4D46_POSITION                                0x6
#define _B4D4_B4D46_SIZE                                    0x1
#define _B4D4_B4D46_LENGTH                                  0x1
#define _B4D4_B4D46_MASK                                    0x40
#define _B4D4_B4D47_POSN                                    0x7
#define _B4D4_B4D47_POSITION                                0x7
#define _B4D4_B4D47_SIZE                                    0x1
#define _B4D4_B4D47_LENGTH                                  0x1
#define _B4D4_B4D47_MASK                                    0x80

// Register: B4D5
#define B4D5 B4D5
extern volatile unsigned char           B4D5                __at(0xE6B);
#ifndef _LIB_BUILD
asm("B4D5 equ 0E6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D50                  :1;
        unsigned B4D51                  :1;
        unsigned B4D52                  :1;
        unsigned B4D53                  :1;
        unsigned B4D54                  :1;
        unsigned B4D55                  :1;
        unsigned B4D56                  :1;
        unsigned B4D57                  :1;
    };
} B4D5bits_t;
extern volatile B4D5bits_t B4D5bits __at(0xE6B);
// bitfield macros
#define _B4D5_B4D50_POSN                                    0x0
#define _B4D5_B4D50_POSITION                                0x0
#define _B4D5_B4D50_SIZE                                    0x1
#define _B4D5_B4D50_LENGTH                                  0x1
#define _B4D5_B4D50_MASK                                    0x1
#define _B4D5_B4D51_POSN                                    0x1
#define _B4D5_B4D51_POSITION                                0x1
#define _B4D5_B4D51_SIZE                                    0x1
#define _B4D5_B4D51_LENGTH                                  0x1
#define _B4D5_B4D51_MASK                                    0x2
#define _B4D5_B4D52_POSN                                    0x2
#define _B4D5_B4D52_POSITION                                0x2
#define _B4D5_B4D52_SIZE                                    0x1
#define _B4D5_B4D52_LENGTH                                  0x1
#define _B4D5_B4D52_MASK                                    0x4
#define _B4D5_B4D53_POSN                                    0x3
#define _B4D5_B4D53_POSITION                                0x3
#define _B4D5_B4D53_SIZE                                    0x1
#define _B4D5_B4D53_LENGTH                                  0x1
#define _B4D5_B4D53_MASK                                    0x8
#define _B4D5_B4D54_POSN                                    0x4
#define _B4D5_B4D54_POSITION                                0x4
#define _B4D5_B4D54_SIZE                                    0x1
#define _B4D5_B4D54_LENGTH                                  0x1
#define _B4D5_B4D54_MASK                                    0x10
#define _B4D5_B4D55_POSN                                    0x5
#define _B4D5_B4D55_POSITION                                0x5
#define _B4D5_B4D55_SIZE                                    0x1
#define _B4D5_B4D55_LENGTH                                  0x1
#define _B4D5_B4D55_MASK                                    0x20
#define _B4D5_B4D56_POSN                                    0x6
#define _B4D5_B4D56_POSITION                                0x6
#define _B4D5_B4D56_SIZE                                    0x1
#define _B4D5_B4D56_LENGTH                                  0x1
#define _B4D5_B4D56_MASK                                    0x40
#define _B4D5_B4D57_POSN                                    0x7
#define _B4D5_B4D57_POSITION                                0x7
#define _B4D5_B4D57_SIZE                                    0x1
#define _B4D5_B4D57_LENGTH                                  0x1
#define _B4D5_B4D57_MASK                                    0x80

// Register: B4D6
#define B4D6 B4D6
extern volatile unsigned char           B4D6                __at(0xE6C);
#ifndef _LIB_BUILD
asm("B4D6 equ 0E6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D60                  :1;
        unsigned B4D61                  :1;
        unsigned B4D62                  :1;
        unsigned B4D63                  :1;
        unsigned B4D64                  :1;
        unsigned B4D65                  :1;
        unsigned B4D66                  :1;
        unsigned B4D67                  :1;
    };
} B4D6bits_t;
