MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2585/mcu.h
// Register: RXF4SIDH
#define RXF4SIDH RXF4SIDH
extern volatile unsigned char           RXF4SIDH            __at(0xF10);
#ifndef _LIB_BUILD
asm("RXF4SIDH equ 0F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF4SID3               :1;
        unsigned RXF4SID4               :1;
        unsigned RXF4SID5               :1;
        unsigned RXF4SID6               :1;
        unsigned RXF4SID7               :1;
        unsigned RXF4SID8               :1;
        unsigned RXF4SID9               :1;
        unsigned RXF4SID10              :1;
    };
} RXF4SIDHbits_t;
extern volatile RXF4SIDHbits_t RXF4SIDHbits __at(0xF10);
// bitfield macros
#define _RXF4SIDH_SID3_POSN                                 0x0
#define _RXF4SIDH_SID3_POSITION                             0x0
#define _RXF4SIDH_SID3_SIZE                                 0x1
#define _RXF4SIDH_SID3_LENGTH                               0x1
#define _RXF4SIDH_SID3_MASK                                 0x1
#define _RXF4SIDH_SID4_POSN                                 0x1
#define _RXF4SIDH_SID4_POSITION                             0x1
#define _RXF4SIDH_SID4_SIZE                                 0x1
#define _RXF4SIDH_SID4_LENGTH                               0x1
#define _RXF4SIDH_SID4_MASK                                 0x2
#define _RXF4SIDH_SID5_POSN                                 0x2
#define _RXF4SIDH_SID5_POSITION                             0x2
#define _RXF4SIDH_SID5_SIZE                                 0x1
#define _RXF4SIDH_SID5_LENGTH                               0x1
#define _RXF4SIDH_SID5_MASK                                 0x4
#define _RXF4SIDH_SID6_POSN                                 0x3
#define _RXF4SIDH_SID6_POSITION                             0x3
#define _RXF4SIDH_SID6_SIZE                                 0x1
#define _RXF4SIDH_SID6_LENGTH                               0x1
#define _RXF4SIDH_SID6_MASK                                 0x8
#define _RXF4SIDH_SID7_POSN                                 0x4
#define _RXF4SIDH_SID7_POSITION                             0x4
#define _RXF4SIDH_SID7_SIZE                                 0x1
#define _RXF4SIDH_SID7_LENGTH                               0x1
#define _RXF4SIDH_SID7_MASK                                 0x10
#define _RXF4SIDH_SID8_POSN                                 0x5
#define _RXF4SIDH_SID8_POSITION                             0x5
#define _RXF4SIDH_SID8_SIZE                                 0x1
#define _RXF4SIDH_SID8_LENGTH                               0x1
#define _RXF4SIDH_SID8_MASK                                 0x20
#define _RXF4SIDH_SID9_POSN                                 0x6
#define _RXF4SIDH_SID9_POSITION                             0x6
#define _RXF4SIDH_SID9_SIZE                                 0x1
#define _RXF4SIDH_SID9_LENGTH                               0x1
#define _RXF4SIDH_SID9_MASK                                 0x40
#define _RXF4SIDH_SID10_POSN                                0x7
#define _RXF4SIDH_SID10_POSITION                            0x7
#define _RXF4SIDH_SID10_SIZE                                0x1
#define _RXF4SIDH_SID10_LENGTH                              0x1
#define _RXF4SIDH_SID10_MASK                                0x80
#define _RXF4SIDH_RXF4SID3_POSN                             0x0
#define _RXF4SIDH_RXF4SID3_POSITION                         0x0
#define _RXF4SIDH_RXF4SID3_SIZE                             0x1
#define _RXF4SIDH_RXF4SID3_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID3_MASK                             0x1
#define _RXF4SIDH_RXF4SID4_POSN                             0x1
#define _RXF4SIDH_RXF4SID4_POSITION                         0x1
#define _RXF4SIDH_RXF4SID4_SIZE                             0x1
#define _RXF4SIDH_RXF4SID4_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID4_MASK                             0x2
#define _RXF4SIDH_RXF4SID5_POSN                             0x2
#define _RXF4SIDH_RXF4SID5_POSITION                         0x2
#define _RXF4SIDH_RXF4SID5_SIZE                             0x1
#define _RXF4SIDH_RXF4SID5_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID5_MASK                             0x4
#define _RXF4SIDH_RXF4SID6_POSN                             0x3
#define _RXF4SIDH_RXF4SID6_POSITION                         0x3
#define _RXF4SIDH_RXF4SID6_SIZE                             0x1
#define _RXF4SIDH_RXF4SID6_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID6_MASK                             0x8
#define _RXF4SIDH_RXF4SID7_POSN                             0x4
#define _RXF4SIDH_RXF4SID7_POSITION                         0x4
#define _RXF4SIDH_RXF4SID7_SIZE                             0x1
#define _RXF4SIDH_RXF4SID7_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID7_MASK                             0x10
#define _RXF4SIDH_RXF4SID8_POSN                             0x5
#define _RXF4SIDH_RXF4SID8_POSITION                         0x5
#define _RXF4SIDH_RXF4SID8_SIZE                             0x1
#define _RXF4SIDH_RXF4SID8_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID8_MASK                             0x20
#define _RXF4SIDH_RXF4SID9_POSN                             0x6
#define _RXF4SIDH_RXF4SID9_POSITION                         0x6
#define _RXF4SIDH_RXF4SID9_SIZE                             0x1
#define _RXF4SIDH_RXF4SID9_LENGTH                           0x1
#define _RXF4SIDH_RXF4SID9_MASK                             0x40
#define _RXF4SIDH_RXF4SID10_POSN                            0x7
#define _RXF4SIDH_RXF4SID10_POSITION                        0x7
#define _RXF4SIDH_RXF4SID10_SIZE                            0x1
#define _RXF4SIDH_RXF4SID10_LENGTH                          0x1
#define _RXF4SIDH_RXF4SID10_MASK                            0x80

// Register: RXF4SIDL
#define RXF4SIDL RXF4SIDL
extern volatile unsigned char           RXF4SIDL            __at(0xF11);
#ifndef _LIB_BUILD
asm("RXF4SIDL equ 0F11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF4EID16              :1;
        unsigned RXF4EID17              :1;
        unsigned                        :1;
        unsigned RXF4EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF4SID0               :1;
        unsigned RXF4SID1               :1;
        unsigned RXF4SID2               :1;
    };
} RXF4SIDLbits_t;
extern volatile RXF4SIDLbits_t RXF4SIDLbits __at(0xF11);
// bitfield macros
#define _RXF4SIDL_EID16_POSN                                0x0
#define _RXF4SIDL_EID16_POSITION                            0x0
#define _RXF4SIDL_EID16_SIZE                                0x1
#define _RXF4SIDL_EID16_LENGTH                              0x1
#define _RXF4SIDL_EID16_MASK                                0x1
#define _RXF4SIDL_EID17_POSN                                0x1
#define _RXF4SIDL_EID17_POSITION                            0x1
#define _RXF4SIDL_EID17_SIZE                                0x1
#define _RXF4SIDL_EID17_LENGTH                              0x1
#define _RXF4SIDL_EID17_MASK                                0x2
#define _RXF4SIDL_EXIDEN_POSN                               0x3
#define _RXF4SIDL_EXIDEN_POSITION                           0x3
#define _RXF4SIDL_EXIDEN_SIZE                               0x1
#define _RXF4SIDL_EXIDEN_LENGTH                             0x1
#define _RXF4SIDL_EXIDEN_MASK                               0x8
#define _RXF4SIDL_SID0_POSN                                 0x5
#define _RXF4SIDL_SID0_POSITION                             0x5
#define _RXF4SIDL_SID0_SIZE                                 0x1
#define _RXF4SIDL_SID0_LENGTH                               0x1
#define _RXF4SIDL_SID0_MASK                                 0x20
#define _RXF4SIDL_SID1_POSN                                 0x6
#define _RXF4SIDL_SID1_POSITION                             0x6
#define _RXF4SIDL_SID1_SIZE                                 0x1
#define _RXF4SIDL_SID1_LENGTH                               0x1
#define _RXF4SIDL_SID1_MASK                                 0x40
#define _RXF4SIDL_SID2_POSN                                 0x7
#define _RXF4SIDL_SID2_POSITION                             0x7
#define _RXF4SIDL_SID2_SIZE                                 0x1
#define _RXF4SIDL_SID2_LENGTH                               0x1
#define _RXF4SIDL_SID2_MASK                                 0x80
#define _RXF4SIDL_EXIDE_POSN                                0x3
#define _RXF4SIDL_EXIDE_POSITION                            0x3
#define _RXF4SIDL_EXIDE_SIZE                                0x1
#define _RXF4SIDL_EXIDE_LENGTH                              0x1
#define _RXF4SIDL_EXIDE_MASK                                0x8
#define _RXF4SIDL_RXF4EID16_POSN                            0x0
#define _RXF4SIDL_RXF4EID16_POSITION                        0x0
#define _RXF4SIDL_RXF4EID16_SIZE                            0x1
#define _RXF4SIDL_RXF4EID16_LENGTH                          0x1
#define _RXF4SIDL_RXF4EID16_MASK                            0x1
#define _RXF4SIDL_RXF4EID17_POSN                            0x1
#define _RXF4SIDL_RXF4EID17_POSITION                        0x1
#define _RXF4SIDL_RXF4EID17_SIZE                            0x1
#define _RXF4SIDL_RXF4EID17_LENGTH                          0x1
#define _RXF4SIDL_RXF4EID17_MASK                            0x2
#define _RXF4SIDL_RXF4EXIDEN_POSN                           0x3
#define _RXF4SIDL_RXF4EXIDEN_POSITION                       0x3
#define _RXF4SIDL_RXF4EXIDEN_SIZE                           0x1
#define _RXF4SIDL_RXF4EXIDEN_LENGTH                         0x1
#define _RXF4SIDL_RXF4EXIDEN_MASK                           0x8
#define _RXF4SIDL_RXF4SID0_POSN                             0x5
#define _RXF4SIDL_RXF4SID0_POSITION                         0x5
#define _RXF4SIDL_RXF4SID0_SIZE                             0x1
#define _RXF4SIDL_RXF4SID0_LENGTH                           0x1
#define _RXF4SIDL_RXF4SID0_MASK                             0x20
#define _RXF4SIDL_RXF4SID1_POSN                             0x6
#define _RXF4SIDL_RXF4SID1_POSITION                         0x6
#define _RXF4SIDL_RXF4SID1_SIZE                             0x1
#define _RXF4SIDL_RXF4SID1_LENGTH                           0x1
#define _RXF4SIDL_RXF4SID1_MASK                             0x40
#define _RXF4SIDL_RXF4SID2_POSN                             0x7
#define _RXF4SIDL_RXF4SID2_POSITION                         0x7
#define _RXF4SIDL_RXF4SID2_SIZE                             0x1
#define _RXF4SIDL_RXF4SID2_LENGTH                           0x1
#define _RXF4SIDL_RXF4SID2_MASK                             0x80

// Register: RXF4EIDH
#define RXF4EIDH RXF4EIDH
extern volatile unsigned char           RXF4EIDH            __at(0xF12);
#ifndef _LIB_BUILD
asm("RXF4EIDH equ 0F12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF4EID8               :1;
        unsigned RXF4EID9               :1;
        unsigned RXF4EID10              :1;
        unsigned RXF4EID11              :1;
        unsigned RXF4EID12              :1;
        unsigned RXF4EID13              :1;
        unsigned RXF4EID14              :1;
        unsigned RXF4EID15              :1;
    };
} RXF4EIDHbits_t;
extern volatile RXF4EIDHbits_t RXF4EIDHbits __at(0xF12);
// bitfield macros
#define _RXF4EIDH_EID8_POSN                                 0x0
#define _RXF4EIDH_EID8_POSITION                             0x0
#define _RXF4EIDH_EID8_SIZE                                 0x1
#define _RXF4EIDH_EID8_LENGTH                               0x1
#define _RXF4EIDH_EID8_MASK                                 0x1
#define _RXF4EIDH_EID9_POSN                                 0x1
#define _RXF4EIDH_EID9_POSITION                             0x1
#define _RXF4EIDH_EID9_SIZE                                 0x1
#define _RXF4EIDH_EID9_LENGTH                               0x1
#define _RXF4EIDH_EID9_MASK                                 0x2
#define _RXF4EIDH_EID10_POSN                                0x2
#define _RXF4EIDH_EID10_POSITION                            0x2
#define _RXF4EIDH_EID10_SIZE                                0x1
#define _RXF4EIDH_EID10_LENGTH                              0x1
#define _RXF4EIDH_EID10_MASK                                0x4
#define _RXF4EIDH_EID11_POSN                                0x3
#define _RXF4EIDH_EID11_POSITION                            0x3
#define _RXF4EIDH_EID11_SIZE                                0x1
#define _RXF4EIDH_EID11_LENGTH                              0x1
#define _RXF4EIDH_EID11_MASK                                0x8
#define _RXF4EIDH_EID12_POSN                                0x4
#define _RXF4EIDH_EID12_POSITION                            0x4
#define _RXF4EIDH_EID12_SIZE                                0x1
#define _RXF4EIDH_EID12_LENGTH                              0x1
#define _RXF4EIDH_EID12_MASK                                0x10
#define _RXF4EIDH_EID13_POSN                                0x5
#define _RXF4EIDH_EID13_POSITION                            0x5
#define _RXF4EIDH_EID13_SIZE                                0x1
#define _RXF4EIDH_EID13_LENGTH                              0x1
#define _RXF4EIDH_EID13_MASK                                0x20
#define _RXF4EIDH_EID14_POSN                                0x6
#define _RXF4EIDH_EID14_POSITION                            0x6
#define _RXF4EIDH_EID14_SIZE                                0x1
#define _RXF4EIDH_EID14_LENGTH                              0x1
#define _RXF4EIDH_EID14_MASK                                0x40
#define _RXF4EIDH_EID15_POSN                                0x7
#define _RXF4EIDH_EID15_POSITION                            0x7
#define _RXF4EIDH_EID15_SIZE                                0x1
#define _RXF4EIDH_EID15_LENGTH                              0x1
#define _RXF4EIDH_EID15_MASK                                0x80
#define _RXF4EIDH_RXF4EID8_POSN                             0x0
#define _RXF4EIDH_RXF4EID8_POSITION                         0x0
#define _RXF4EIDH_RXF4EID8_SIZE                             0x1
#define _RXF4EIDH_RXF4EID8_LENGTH                           0x1
#define _RXF4EIDH_RXF4EID8_MASK                             0x1
#define _RXF4EIDH_RXF4EID9_POSN                             0x1
#define _RXF4EIDH_RXF4EID9_POSITION                         0x1
#define _RXF4EIDH_RXF4EID9_SIZE                             0x1
#define _RXF4EIDH_RXF4EID9_LENGTH                           0x1
#define _RXF4EIDH_RXF4EID9_MASK                             0x2
#define _RXF4EIDH_RXF4EID10_POSN                            0x2
#define _RXF4EIDH_RXF4EID10_POSITION                        0x2
#define _RXF4EIDH_RXF4EID10_SIZE                            0x1
#define _RXF4EIDH_RXF4EID10_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID10_MASK                            0x4
#define _RXF4EIDH_RXF4EID11_POSN                            0x3
#define _RXF4EIDH_RXF4EID11_POSITION                        0x3
#define _RXF4EIDH_RXF4EID11_SIZE                            0x1
#define _RXF4EIDH_RXF4EID11_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID11_MASK                            0x8
#define _RXF4EIDH_RXF4EID12_POSN                            0x4
#define _RXF4EIDH_RXF4EID12_POSITION                        0x4
#define _RXF4EIDH_RXF4EID12_SIZE                            0x1
#define _RXF4EIDH_RXF4EID12_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID12_MASK                            0x10
#define _RXF4EIDH_RXF4EID13_POSN                            0x5
#define _RXF4EIDH_RXF4EID13_POSITION                        0x5
#define _RXF4EIDH_RXF4EID13_SIZE                            0x1
#define _RXF4EIDH_RXF4EID13_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID13_MASK                            0x20
#define _RXF4EIDH_RXF4EID14_POSN                            0x6
#define _RXF4EIDH_RXF4EID14_POSITION                        0x6
#define _RXF4EIDH_RXF4EID14_SIZE                            0x1
#define _RXF4EIDH_RXF4EID14_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID14_MASK                            0x40
#define _RXF4EIDH_RXF4EID15_POSN                            0x7
#define _RXF4EIDH_RXF4EID15_POSITION                        0x7
#define _RXF4EIDH_RXF4EID15_SIZE                            0x1
#define _RXF4EIDH_RXF4EID15_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID15_MASK                            0x80

// Register: RXF4EIDL
#define RXF4EIDL RXF4EIDL
extern volatile unsigned char           RXF4EIDL            __at(0xF13);
#ifndef _LIB_BUILD
asm("RXF4EIDL equ 0F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF4EID0               :1;
        unsigned RXF4EID1               :1;
        unsigned RXF4EID2               :1;
        unsigned RXF4EID3               :1;
        unsigned RXF4EID4               :1;
        unsigned RXF4EID5               :1;
        unsigned RXF4EID6               :1;
        unsigned RXF4EID7               :1;
    };
} RXF4EIDLbits_t;
extern volatile RXF4EIDLbits_t RXF4EIDLbits __at(0xF13);
// bitfield macros
#define _RXF4EIDL_EID0_POSN                                 0x0
#define _RXF4EIDL_EID0_POSITION                             0x0
#define _RXF4EIDL_EID0_SIZE                                 0x1
#define _RXF4EIDL_EID0_LENGTH                               0x1
#define _RXF4EIDL_EID0_MASK                                 0x1
#define _RXF4EIDL_EID1_POSN                                 0x1
#define _RXF4EIDL_EID1_POSITION                             0x1
#define _RXF4EIDL_EID1_SIZE                                 0x1
#define _RXF4EIDL_EID1_LENGTH                               0x1
#define _RXF4EIDL_EID1_MASK                                 0x2
#define _RXF4EIDL_EID2_POSN                                 0x2
#define _RXF4EIDL_EID2_POSITION                             0x2
#define _RXF4EIDL_EID2_SIZE                                 0x1
#define _RXF4EIDL_EID2_LENGTH                               0x1
#define _RXF4EIDL_EID2_MASK                                 0x4
#define _RXF4EIDL_EID3_POSN                                 0x3
#define _RXF4EIDL_EID3_POSITION                             0x3
#define _RXF4EIDL_EID3_SIZE                                 0x1
#define _RXF4EIDL_EID3_LENGTH                               0x1
#define _RXF4EIDL_EID3_MASK                                 0x8
#define _RXF4EIDL_EID4_POSN                                 0x4
#define _RXF4EIDL_EID4_POSITION                             0x4
#define _RXF4EIDL_EID4_SIZE                                 0x1
#define _RXF4EIDL_EID4_LENGTH                               0x1
#define _RXF4EIDL_EID4_MASK                                 0x10
#define _RXF4EIDL_EID5_POSN                                 0x5
#define _RXF4EIDL_EID5_POSITION                             0x5
#define _RXF4EIDL_EID5_SIZE                                 0x1
#define _RXF4EIDL_EID5_LENGTH                               0x1
#define _RXF4EIDL_EID5_MASK                                 0x20
#define _RXF4EIDL_EID6_POSN                                 0x6
#define _RXF4EIDL_EID6_POSITION                             0x6
#define _RXF4EIDL_EID6_SIZE                                 0x1
#define _RXF4EIDL_EID6_LENGTH                               0x1
#define _RXF4EIDL_EID6_MASK                                 0x40
#define _RXF4EIDL_EID7_POSN                                 0x7
#define _RXF4EIDL_EID7_POSITION                             0x7
#define _RXF4EIDL_EID7_SIZE                                 0x1
#define _RXF4EIDL_EID7_LENGTH                               0x1
#define _RXF4EIDL_EID7_MASK                                 0x80
#define _RXF4EIDL_RXF4EID0_POSN                             0x0
#define _RXF4EIDL_RXF4EID0_POSITION                         0x0
#define _RXF4EIDL_RXF4EID0_SIZE                             0x1
#define _RXF4EIDL_RXF4EID0_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID0_MASK                             0x1
#define _RXF4EIDL_RXF4EID1_POSN                             0x1
#define _RXF4EIDL_RXF4EID1_POSITION                         0x1
#define _RXF4EIDL_RXF4EID1_SIZE                             0x1
#define _RXF4EIDL_RXF4EID1_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID1_MASK                             0x2
#define _RXF4EIDL_RXF4EID2_POSN                             0x2
#define _RXF4EIDL_RXF4EID2_POSITION                         0x2
#define _RXF4EIDL_RXF4EID2_SIZE                             0x1
#define _RXF4EIDL_RXF4EID2_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID2_MASK                             0x4
#define _RXF4EIDL_RXF4EID3_POSN                             0x3
#define _RXF4EIDL_RXF4EID3_POSITION                         0x3
#define _RXF4EIDL_RXF4EID3_SIZE                             0x1
#define _RXF4EIDL_RXF4EID3_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID3_MASK                             0x8
#define _RXF4EIDL_RXF4EID4_POSN                             0x4
#define _RXF4EIDL_RXF4EID4_POSITION                         0x4
#define _RXF4EIDL_RXF4EID4_SIZE                             0x1
#define _RXF4EIDL_RXF4EID4_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID4_MASK                             0x10
#define _RXF4EIDL_RXF4EID5_POSN                             0x5
#define _RXF4EIDL_RXF4EID5_POSITION                         0x5
#define _RXF4EIDL_RXF4EID5_SIZE                             0x1
#define _RXF4EIDL_RXF4EID5_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID5_MASK                             0x20
#define _RXF4EIDL_RXF4EID6_POSN                             0x6
#define _RXF4EIDL_RXF4EID6_POSITION                         0x6
#define _RXF4EIDL_RXF4EID6_SIZE                             0x1
#define _RXF4EIDL_RXF4EID6_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID6_MASK                             0x40
#define _RXF4EIDL_RXF4EID7_POSN                             0x7
#define _RXF4EIDL_RXF4EID7_POSITION                         0x7
#define _RXF4EIDL_RXF4EID7_SIZE                             0x1
#define _RXF4EIDL_RXF4EID7_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID7_MASK                             0x80

