MikroElektronika/core_packages/PIC/XC8/def/PIC18LF2585/mcu.h
#define                                 TXB1D73_bit         _BIT_ACCESS(TXB1D7,3)
// TXB1D7<TXB1D74>
extern volatile __bit                   TXB1D74             __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 TXB1D74_bit         _BIT_ACCESS(TXB1D7,4)
// TXB1D7<TXB1D75>
extern volatile __bit                   TXB1D75             __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 TXB1D75_bit         _BIT_ACCESS(TXB1D7,5)
// TXB1D7<TXB1D76>
extern volatile __bit                   TXB1D76             __at(0x79EE);	// @ (0xF3D * 8 + 6)
#define                                 TXB1D76_bit         _BIT_ACCESS(TXB1D7,6)
// TXB1D7<TXB1D77>
extern volatile __bit                   TXB1D77             __at(0x79EF);	// @ (0xF3D * 8 + 7)
#define                                 TXB1D77_bit         _BIT_ACCESS(TXB1D7,7)
// TXB1DLC<TXB1DLC0>
extern volatile __bit                   TXB1DLC0            __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 TXB1DLC0_bit        _BIT_ACCESS(TXB1DLC,0)
// TXB1DLC<TXB1DLC1>
extern volatile __bit                   TXB1DLC1            __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 TXB1DLC1_bit        _BIT_ACCESS(TXB1DLC,1)
// TXB1DLC<TXB1DLC2>
extern volatile __bit                   TXB1DLC2            __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 TXB1DLC2_bit        _BIT_ACCESS(TXB1DLC,2)
// TXB1DLC<TXB1DLC3>
extern volatile __bit                   TXB1DLC3            __at(0x79AB);	// @ (0xF35 * 8 + 3)
#define                                 TXB1DLC3_bit        _BIT_ACCESS(TXB1DLC,3)
// TXB1EIDL<TXB1EID0>
extern volatile __bit                   TXB1EID0            __at(0x79A0);	// @ (0xF34 * 8 + 0)
#define                                 TXB1EID0_bit        _BIT_ACCESS(TXB1EIDL,0)
// TXB1EIDL<TXB1EID1>
extern volatile __bit                   TXB1EID1            __at(0x79A1);	// @ (0xF34 * 8 + 1)
#define                                 TXB1EID1_bit        _BIT_ACCESS(TXB1EIDL,1)
// TXB1EIDH<TXB1EID10>
extern volatile __bit                   TXB1EID10           __at(0x799A);	// @ (0xF33 * 8 + 2)
#define                                 TXB1EID10_bit       _BIT_ACCESS(TXB1EIDH,2)
// TXB1EIDH<TXB1EID11>
extern volatile __bit                   TXB1EID11           __at(0x799B);	// @ (0xF33 * 8 + 3)
#define                                 TXB1EID11_bit       _BIT_ACCESS(TXB1EIDH,3)
// TXB1EIDH<TXB1EID12>
extern volatile __bit                   TXB1EID12           __at(0x799C);	// @ (0xF33 * 8 + 4)
#define                                 TXB1EID12_bit       _BIT_ACCESS(TXB1EIDH,4)
// TXB1EIDH<TXB1EID13>
extern volatile __bit                   TXB1EID13           __at(0x799D);	// @ (0xF33 * 8 + 5)
#define                                 TXB1EID13_bit       _BIT_ACCESS(TXB1EIDH,5)
// TXB1EIDH<TXB1EID14>
extern volatile __bit                   TXB1EID14           __at(0x799E);	// @ (0xF33 * 8 + 6)
#define                                 TXB1EID14_bit       _BIT_ACCESS(TXB1EIDH,6)
// TXB1EIDH<TXB1EID15>
extern volatile __bit                   TXB1EID15           __at(0x799F);	// @ (0xF33 * 8 + 7)
#define                                 TXB1EID15_bit       _BIT_ACCESS(TXB1EIDH,7)
// TXB1SIDL<TXB1EID16>
extern volatile __bit                   TXB1EID16           __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 TXB1EID16_bit       _BIT_ACCESS(TXB1SIDL,0)
// TXB1SIDL<TXB1EID17>
extern volatile __bit                   TXB1EID17           __at(0x7991);	// @ (0xF32 * 8 + 1)
#define                                 TXB1EID17_bit       _BIT_ACCESS(TXB1SIDL,1)
// TXB1EIDL<TXB1EID2>
extern volatile __bit                   TXB1EID2            __at(0x79A2);	// @ (0xF34 * 8 + 2)
#define                                 TXB1EID2_bit        _BIT_ACCESS(TXB1EIDL,2)
// TXB1EIDL<TXB1EID3>
extern volatile __bit                   TXB1EID3            __at(0x79A3);	// @ (0xF34 * 8 + 3)
#define                                 TXB1EID3_bit        _BIT_ACCESS(TXB1EIDL,3)
// TXB1EIDL<TXB1EID4>
extern volatile __bit                   TXB1EID4            __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 TXB1EID4_bit        _BIT_ACCESS(TXB1EIDL,4)
// TXB1EIDL<TXB1EID5>
extern volatile __bit                   TXB1EID5            __at(0x79A5);	// @ (0xF34 * 8 + 5)
#define                                 TXB1EID5_bit        _BIT_ACCESS(TXB1EIDL,5)
// TXB1EIDL<TXB1EID6>
extern volatile __bit                   TXB1EID6            __at(0x79A6);	// @ (0xF34 * 8 + 6)
#define                                 TXB1EID6_bit        _BIT_ACCESS(TXB1EIDL,6)
// TXB1EIDL<TXB1EID7>
extern volatile __bit                   TXB1EID7            __at(0x79A7);	// @ (0xF34 * 8 + 7)
#define                                 TXB1EID7_bit        _BIT_ACCESS(TXB1EIDL,7)
// TXB1EIDH<TXB1EID8>
extern volatile __bit                   TXB1EID8            __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 TXB1EID8_bit        _BIT_ACCESS(TXB1EIDH,0)
// TXB1EIDH<TXB1EID9>
extern volatile __bit                   TXB1EID9            __at(0x7999);	// @ (0xF33 * 8 + 1)
#define                                 TXB1EID9_bit        _BIT_ACCESS(TXB1EIDH,1)
// TXB1CON<TXB1ERR>
extern volatile __bit                   TXB1ERR             __at(0x7984);	// @ (0xF30 * 8 + 4)
#define                                 TXB1ERR_bit         _BIT_ACCESS(TXB1CON,4)
// TXB1SIDL<TXB1EXIDE>
extern volatile __bit                   TXB1EXIDE           __at(0x7993);	// @ (0xF32 * 8 + 3)
#define                                 TXB1EXIDE_bit       _BIT_ACCESS(TXB1SIDL,3)
// PIR3<TXB1IF>
extern volatile __bit                   TXB1IF              __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 TXB1IF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<TXB1IP>
extern volatile __bit                   TXB1IP              __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 TXB1IP_bit          _BIT_ACCESS(IPR3,3)
// TXB1CON<TXB1LARB>
extern volatile __bit                   TXB1LARB            __at(0x7985);	// @ (0xF30 * 8 + 5)
#define                                 TXB1LARB_bit        _BIT_ACCESS(TXB1CON,5)
// TXB1CON<TXB1PRI0>
extern volatile __bit                   TXB1PRI0            __at(0x7980);	// @ (0xF30 * 8 + 0)
#define                                 TXB1PRI0_bit        _BIT_ACCESS(TXB1CON,0)
// TXB1CON<TXB1PRI1>
extern volatile __bit                   TXB1PRI1            __at(0x7981);	// @ (0xF30 * 8 + 1)
#define                                 TXB1PRI1_bit        _BIT_ACCESS(TXB1CON,1)
// TXB1CON<TXB1REQ>
extern volatile __bit                   TXB1REQ             __at(0x7983);	// @ (0xF30 * 8 + 3)
#define                                 TXB1REQ_bit         _BIT_ACCESS(TXB1CON,3)
// TXB1DLC<TXB1RTR>
extern volatile __bit                   TXB1RTR             __at(0x79AE);	// @ (0xF35 * 8 + 6)
#define                                 TXB1RTR_bit         _BIT_ACCESS(TXB1DLC,6)
// TXB1SIDL<TXB1SID0>
extern volatile __bit                   TXB1SID0            __at(0x7995);	// @ (0xF32 * 8 + 5)
#define                                 TXB1SID0_bit        _BIT_ACCESS(TXB1SIDL,5)
// TXB1SIDL<TXB1SID1>
extern volatile __bit                   TXB1SID1            __at(0x7996);	// @ (0xF32 * 8 + 6)
#define                                 TXB1SID1_bit        _BIT_ACCESS(TXB1SIDL,6)
// TXB1SIDH<TXB1SID10>
extern volatile __bit                   TXB1SID10           __at(0x798F);	// @ (0xF31 * 8 + 7)
#define                                 TXB1SID10_bit       _BIT_ACCESS(TXB1SIDH,7)
// TXB1SIDL<TXB1SID2>
extern volatile __bit                   TXB1SID2            __at(0x7997);	// @ (0xF32 * 8 + 7)
#define                                 TXB1SID2_bit        _BIT_ACCESS(TXB1SIDL,7)
// TXB1SIDH<TXB1SID3>
extern volatile __bit                   TXB1SID3            __at(0x7988);	// @ (0xF31 * 8 + 0)
#define                                 TXB1SID3_bit        _BIT_ACCESS(TXB1SIDH,0)
// TXB1SIDH<TXB1SID4>
extern volatile __bit                   TXB1SID4            __at(0x7989);	// @ (0xF31 * 8 + 1)
#define                                 TXB1SID4_bit        _BIT_ACCESS(TXB1SIDH,1)
// TXB1SIDH<TXB1SID5>
extern volatile __bit                   TXB1SID5            __at(0x798A);	// @ (0xF31 * 8 + 2)
#define                                 TXB1SID5_bit        _BIT_ACCESS(TXB1SIDH,2)
// TXB1SIDH<TXB1SID6>
extern volatile __bit                   TXB1SID6            __at(0x798B);	// @ (0xF31 * 8 + 3)
#define                                 TXB1SID6_bit        _BIT_ACCESS(TXB1SIDH,3)
// TXB1SIDH<TXB1SID7>
extern volatile __bit                   TXB1SID7            __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 TXB1SID7_bit        _BIT_ACCESS(TXB1SIDH,4)
// TXB1SIDH<TXB1SID8>
extern volatile __bit                   TXB1SID8            __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 TXB1SID8_bit        _BIT_ACCESS(TXB1SIDH,5)
// TXB1SIDH<TXB1SID9>
extern volatile __bit                   TXB1SID9            __at(0x798E);	// @ (0xF31 * 8 + 6)
#define                                 TXB1SID9_bit        _BIT_ACCESS(TXB1SIDH,6)
// TXB2CON<TXB2ABT>
extern volatile __bit                   TXB2ABT             __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 TXB2ABT_bit         _BIT_ACCESS(TXB2CON,6)
// TXB2D0<TXB2D00>
extern volatile __bit                   TXB2D00             __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 TXB2D00_bit         _BIT_ACCESS(TXB2D0,0)
// TXB2D0<TXB2D01>
extern volatile __bit                   TXB2D01             __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 TXB2D01_bit         _BIT_ACCESS(TXB2D0,1)
// TXB2D0<TXB2D02>
extern volatile __bit                   TXB2D02             __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 TXB2D02_bit         _BIT_ACCESS(TXB2D0,2)
// TXB2D0<TXB2D03>
extern volatile __bit                   TXB2D03             __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 TXB2D03_bit         _BIT_ACCESS(TXB2D0,3)
// TXB2D0<TXB2D04>
extern volatile __bit                   TXB2D04             __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 TXB2D04_bit         _BIT_ACCESS(TXB2D0,4)
// TXB2D0<TXB2D05>
extern volatile __bit                   TXB2D05             __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 TXB2D05_bit         _BIT_ACCESS(TXB2D0,5)
// TXB2D0<TXB2D06>
extern volatile __bit                   TXB2D06             __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 TXB2D06_bit         _BIT_ACCESS(TXB2D0,6)
// TXB2D0<TXB2D07>
extern volatile __bit                   TXB2D07             __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 TXB2D07_bit         _BIT_ACCESS(TXB2D0,7)
// TXB2D1<TXB2D10>
extern volatile __bit                   TXB2D10             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 TXB2D10_bit         _BIT_ACCESS(TXB2D1,0)
// TXB2D1<TXB2D11>
extern volatile __bit                   TXB2D11             __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 TXB2D11_bit         _BIT_ACCESS(TXB2D1,1)
// TXB2D1<TXB2D12>
extern volatile __bit                   TXB2D12             __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 TXB2D12_bit         _BIT_ACCESS(TXB2D1,2)
// TXB2D1<TXB2D13>
extern volatile __bit                   TXB2D13             __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 TXB2D13_bit         _BIT_ACCESS(TXB2D1,3)
// TXB2D1<TXB2D14>
extern volatile __bit                   TXB2D14             __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 TXB2D14_bit         _BIT_ACCESS(TXB2D1,4)
// TXB2D1<TXB2D15>
extern volatile __bit                   TXB2D15             __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 TXB2D15_bit         _BIT_ACCESS(TXB2D1,5)
// TXB2D1<TXB2D16>
extern volatile __bit                   TXB2D16             __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 TXB2D16_bit         _BIT_ACCESS(TXB2D1,6)
// TXB2D1<TXB2D17>
extern volatile __bit                   TXB2D17             __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 TXB2D17_bit         _BIT_ACCESS(TXB2D1,7)
// TXB2D2<TXB2D20>
extern volatile __bit                   TXB2D20             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 TXB2D20_bit         _BIT_ACCESS(TXB2D2,0)
// TXB2D2<TXB2D21>
extern volatile __bit                   TXB2D21             __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 TXB2D21_bit         _BIT_ACCESS(TXB2D2,1)
// TXB2D2<TXB2D22>
extern volatile __bit                   TXB2D22             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 TXB2D22_bit         _BIT_ACCESS(TXB2D2,2)
// TXB2D2<TXB2D23>
extern volatile __bit                   TXB2D23             __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 TXB2D23_bit         _BIT_ACCESS(TXB2D2,3)
// TXB2D2<TXB2D24>
extern volatile __bit                   TXB2D24             __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 TXB2D24_bit         _BIT_ACCESS(TXB2D2,4)
// TXB2D2<TXB2D25>
extern volatile __bit                   TXB2D25             __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 TXB2D25_bit         _BIT_ACCESS(TXB2D2,5)
// TXB2D2<TXB2D26>
extern volatile __bit                   TXB2D26             __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 TXB2D26_bit         _BIT_ACCESS(TXB2D2,6)
// TXB2D2<TXB2D27>
extern volatile __bit                   TXB2D27             __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 TXB2D27_bit         _BIT_ACCESS(TXB2D2,7)
// TXB2D3<TXB2D30>
extern volatile __bit                   TXB2D30             __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 TXB2D30_bit         _BIT_ACCESS(TXB2D3,0)
// TXB2D3<TXB2D31>
extern volatile __bit                   TXB2D31             __at(0x7949);	// @ (0xF29 * 8 + 1)
#define                                 TXB2D31_bit         _BIT_ACCESS(TXB2D3,1)
// TXB2D3<TXB2D32>
extern volatile __bit                   TXB2D32             __at(0x794A);	// @ (0xF29 * 8 + 2)
#define                                 TXB2D32_bit         _BIT_ACCESS(TXB2D3,2)
// TXB2D3<TXB2D33>
extern volatile __bit                   TXB2D33             __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 TXB2D33_bit         _BIT_ACCESS(TXB2D3,3)
// TXB2D3<TXB2D34>
extern volatile __bit                   TXB2D34             __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 TXB2D34_bit         _BIT_ACCESS(TXB2D3,4)
// TXB2D3<TXB2D35>
extern volatile __bit                   TXB2D35             __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 TXB2D35_bit         _BIT_ACCESS(TXB2D3,5)
// TXB2D3<TXB2D36>
extern volatile __bit                   TXB2D36             __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 TXB2D36_bit         _BIT_ACCESS(TXB2D3,6)
// TXB2D3<TXB2D37>
extern volatile __bit                   TXB2D37             __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 TXB2D37_bit         _BIT_ACCESS(TXB2D3,7)
// TXB2D4<TXB2D40>
extern volatile __bit                   TXB2D40             __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 TXB2D40_bit         _BIT_ACCESS(TXB2D4,0)
// TXB2D4<TXB2D41>
extern volatile __bit                   TXB2D41             __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 TXB2D41_bit         _BIT_ACCESS(TXB2D4,1)
// TXB2D4<TXB2D42>
extern volatile __bit                   TXB2D42             __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 TXB2D42_bit         _BIT_ACCESS(TXB2D4,2)
// TXB2D4<TXB2D43>
extern volatile __bit                   TXB2D43             __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 TXB2D43_bit         _BIT_ACCESS(TXB2D4,3)
// TXB2D4<TXB2D44>
extern volatile __bit                   TXB2D44             __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 TXB2D44_bit         _BIT_ACCESS(TXB2D4,4)
// TXB2D4<TXB2D45>
extern volatile __bit                   TXB2D45             __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 TXB2D45_bit         _BIT_ACCESS(TXB2D4,5)
// TXB2D4<TXB2D46>
extern volatile __bit                   TXB2D46             __at(0x7956);	// @ (0xF2A * 8 + 6)
#define                                 TXB2D46_bit         _BIT_ACCESS(TXB2D4,6)
// TXB2D4<TXB2D47>
extern volatile __bit                   TXB2D47             __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 TXB2D47_bit         _BIT_ACCESS(TXB2D4,7)
// TXB2D5<TXB2D50>
extern volatile __bit                   TXB2D50             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 TXB2D50_bit         _BIT_ACCESS(TXB2D5,0)
// TXB2D5<TXB2D51>
extern volatile __bit                   TXB2D51             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 TXB2D51_bit         _BIT_ACCESS(TXB2D5,1)
// TXB2D5<TXB2D52>
extern volatile __bit                   TXB2D52             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 TXB2D52_bit         _BIT_ACCESS(TXB2D5,2)
// TXB2D5<TXB2D53>
extern volatile __bit                   TXB2D53             __at(0x795B);	// @ (0xF2B * 8 + 3)
#define                                 TXB2D53_bit         _BIT_ACCESS(TXB2D5,3)
// TXB2D5<TXB2D54>
extern volatile __bit                   TXB2D54             __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 TXB2D54_bit         _BIT_ACCESS(TXB2D5,4)
// TXB2D5<TXB2D55>
extern volatile __bit                   TXB2D55             __at(0x795D);	// @ (0xF2B * 8 + 5)
#define                                 TXB2D55_bit         _BIT_ACCESS(TXB2D5,5)
// TXB2D5<TXB2D56>
extern volatile __bit                   TXB2D56             __at(0x795E);	// @ (0xF2B * 8 + 6)
#define                                 TXB2D56_bit         _BIT_ACCESS(TXB2D5,6)
// TXB2D5<TXB2D57>
extern volatile __bit                   TXB2D57             __at(0x795F);	// @ (0xF2B * 8 + 7)
#define                                 TXB2D57_bit         _BIT_ACCESS(TXB2D5,7)
// TXB2D6<TXB2D60>
extern volatile __bit                   TXB2D60             __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 TXB2D60_bit         _BIT_ACCESS(TXB2D6,0)
// TXB2D6<TXB2D61>
extern volatile __bit                   TXB2D61             __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 TXB2D61_bit         _BIT_ACCESS(TXB2D6,1)
// TXB2D6<TXB2D62>
extern volatile __bit                   TXB2D62             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 TXB2D62_bit         _BIT_ACCESS(TXB2D6,2)
// TXB2D6<TXB2D63>
extern volatile __bit                   TXB2D63             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 TXB2D63_bit         _BIT_ACCESS(TXB2D6,3)
// TXB2D6<TXB2D64>
extern volatile __bit                   TXB2D64             __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 TXB2D64_bit         _BIT_ACCESS(TXB2D6,4)
// TXB2D6<TXB2D65>
extern volatile __bit                   TXB2D65             __at(0x7965);	// @ (0xF2C * 8 + 5)
#define                                 TXB2D65_bit         _BIT_ACCESS(TXB2D6,5)
// TXB2D6<TXB2D66>
extern volatile __bit                   TXB2D66             __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 TXB2D66_bit         _BIT_ACCESS(TXB2D6,6)
// TXB2D6<TXB2D67>
extern volatile __bit                   TXB2D67             __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 TXB2D67_bit         _BIT_ACCESS(TXB2D6,7)
// TXB2D7<TXB2D70>
extern volatile __bit                   TXB2D70             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 TXB2D70_bit         _BIT_ACCESS(TXB2D7,0)
// TXB2D7<TXB2D71>
extern volatile __bit                   TXB2D71             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 TXB2D71_bit         _BIT_ACCESS(TXB2D7,1)
// TXB2D7<TXB2D72>
extern volatile __bit                   TXB2D72             __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 TXB2D72_bit         _BIT_ACCESS(TXB2D7,2)
// TXB2D7<TXB2D73>
extern volatile __bit                   TXB2D73             __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 TXB2D73_bit         _BIT_ACCESS(TXB2D7,3)
// TXB2D7<TXB2D74>
extern volatile __bit                   TXB2D74             __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 TXB2D74_bit         _BIT_ACCESS(TXB2D7,4)
// TXB2D7<TXB2D75>
extern volatile __bit                   TXB2D75             __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 TXB2D75_bit         _BIT_ACCESS(TXB2D7,5)
// TXB2D7<TXB2D76>
extern volatile __bit                   TXB2D76             __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 TXB2D76_bit         _BIT_ACCESS(TXB2D7,6)
// TXB2D7<TXB2D77>
extern volatile __bit                   TXB2D77             __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 TXB2D77_bit         _BIT_ACCESS(TXB2D7,7)
// TXB2DLC<TXB2DLC0>
extern volatile __bit                   TXB2DLC0            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 TXB2DLC0_bit        _BIT_ACCESS(TXB2DLC,0)
// TXB2DLC<TXB2DLC1>
extern volatile __bit                   TXB2DLC1            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 TXB2DLC1_bit        _BIT_ACCESS(TXB2DLC,1)
// TXB2DLC<TXB2DLC2>
extern volatile __bit                   TXB2DLC2            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 TXB2DLC2_bit        _BIT_ACCESS(TXB2DLC,2)
// TXB2DLC<TXB2DLC3>
extern volatile __bit                   TXB2DLC3            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 TXB2DLC3_bit        _BIT_ACCESS(TXB2DLC,3)
// TXB2EIDL<TXB2EID0>
extern volatile __bit                   TXB2EID0            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 TXB2EID0_bit        _BIT_ACCESS(TXB2EIDL,0)
// TXB2EIDL<TXB2EID1>
extern volatile __bit                   TXB2EID1            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 TXB2EID1_bit        _BIT_ACCESS(TXB2EIDL,1)
// TXB2EIDH<TXB2EID10>
extern volatile __bit                   TXB2EID10           __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 TXB2EID10_bit       _BIT_ACCESS(TXB2EIDH,2)
// TXB2EIDH<TXB2EID11>
extern volatile __bit                   TXB2EID11           __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 TXB2EID11_bit       _BIT_ACCESS(TXB2EIDH,3)
// TXB2EIDH<TXB2EID12>
extern volatile __bit                   TXB2EID12           __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 TXB2EID12_bit       _BIT_ACCESS(TXB2EIDH,4)
// TXB2EIDH<TXB2EID13>
extern volatile __bit                   TXB2EID13           __at(0x791D);	// @ (0xF23 * 8 + 5)
